**purpose of jupyter notebook**
1. we can develop documentation for code
2. we write python logic

**markdown cell --> for documentation**

**code cell --> for python code**

# syntax for markdown
# title
## title2
### title3

Machine **Learning** Program

**short cuts for jupyternotebook**

### to run the current cell
    shift enter

#### to create new cell above the current cell

    esc A

#### to create new cell below the current cell

esc b

#### to delete current cell

esc d d

#### working with simple csv file

**how to read csv in python?**

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('employee.csv') # df ---> DataFrame
df

   Salary  Experience
0   10000           1
1   16000           2
2   20000           3
3   27000           4
4     NaN           5
5   35000           6
6   70000           7
7  apssdc          10

**is there any missing values?**

In [4]:
df.isna().sum()

Salary        1
Experience    0
dtype: int64

**if you want replace with default value**

df.fillna(default_value)

In [5]:
df.fillna(1000)

   Salary  Experience
0   10000           1
1   16000           2
2   20000           3
3   27000           4
4    1000           5
5   35000           6
6   70000           7
7  apssdc          10